bookers/app/controllers/books_controller.rb

  def show
    @bookdetail = Book.find(params[:id])
    @book = Book.new
    @user = User.find(@bookdetail.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
    if @book.save #入力されたデータをdbに保存する。
        redirect_to @book, notice: "You have creatad book successfully."#保存された場合の移動先を指定。
    else
        @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "fudged"], ["body", "sdfgsdfgs"], ["user_id", 2], ["created_at", "2020-05-20 17:54:48.471186"], ["updated_at", "2020-05-20 17:54:48.471186"]]
SELECT "books".* FROM "books"