bookers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "information_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "秀平"], ["introduction", "こんにちは。"], ["information_image_id", "29a9d77a1912170ecd1ebe2609396cba34c8bc135dcfcc51b711a7461768"], ["updated_at", "2020-05-20 21:11:56.186302"], ["id", 1]]
---
  def update
        @user = User.find(params[:id])
        if  @user.update(user_params)